{
  "architectures": [
    "Qwen3ForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "auto_map": {
    "AutoConfig": "configuration_qwen3.Qwen3Config",
    "AutoModelForCausalLM": "modeling_qwen3.Qwen3ForCausalLM"
  },
  "bos_token_id": 151643,
  "dtype": "bfloat16",
  "elementwise_attn_output_gate": false,
  "ffn_output_gate": true,
  "eos_token_id": 151645,
  "head_dim": 128,
  "headwise_attn_output_gate": false,
  "hidden_act": "silu",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 6144,
  "max_position_embeddings": 40960,
  "max_window_layers": 28,
  "model_type": "qwen3",
  "num_attention_heads": 16,
  "num_hidden_layers": 28,
  "num_key_value_heads": 8,
  "qkv_bias": false,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 1000000,
  "sliding_window": null,
  "tie_word_embeddings": true, 
  "transformers_version": "4.57.3",
  "use_cache": true,
  "use_qk_norm": true,
  "use_sliding_window": false,
  "vocab_size": 151936
}
